Revit 2026 API

# Entity Constructor

---

The default-constructed Entity is invalid.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Entity()
```
```vb
Public Sub New
```
```cpp
public:
Entity()
```
```fsharp
new : unit -> Entity
```

Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.

#### Reference

Entity Class

Entity Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace